## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_key.minha_chave_kms will be created
  + resource "aws_kms_key" "minha_chave_kms" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 20
      + description                        = "An example symmetric encryption KMS key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "minha-chave-kms"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "minha-chave-kms"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>